{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "How are you?",
        "Is anyone there?",
        "Hello",
        "Good day",
        "What's up",
        "how are ya",
        "heyy",
        "whatsup"
      ],
      "responses": [
        "Hey there!",
        "Hello! How can I assist you?",
        "Hi, how's it going?",
        "Hey, nice to see you!",
        "Hi there! What can I do for you today?",
        "Hello! Hope you're having a great day!"
      ],
      "context_set": ""
    },
    {
      "tag": "goodbye",
      "patterns": [
        "cya",
        "see you",
        "bye bye",
        "See you later",
        "Goodbye",
        "I am Leaving",
        "Bye",
        "Have a Good day",
        "talk to you later",
        "i got to go",
        "It was nice chatting with you"
      ],
      "responses": [
        "Talk to you later",
        "Goodbye!",
        "Have a nice day!",
        "Goodbye! Feel free to come back anytime.",
        "See you later! Have a wonderful day.",
        "Talk to you soon! Take care.",
        "It was nice chatting with you too. Have a great day!"
      ],
      "context_set": ""
    },
    {
      "tag": "name",
      "patterns": [
        "do you have a name",
        "what are you called",
        "what is your name",
        "what should I call you",
        "whats your name?",
        "what are you",
        "who are you",
        "who is this",
        "what am i chatting to",
        "who am i talking to"
      ],
      "responses": [
        "My name is Emma, and I am your voice assistant.",
        "I am a voice assistant, you can call me Emma.",
        "I am Emma, and I am here to assist you."
      ],
      "context_set": ""
    },
    {
      "tag": "acknowledgement",
      "patterns": [
        "ok",
        "okie",
        "nice work",
        "well done",
        "good job",
        "thanks for the help",
        "Thank You",
        "its ok",
        "Thanks",
        "Good work",
        "k",
        "okay"
      ],
      "responses": [
        "I am glad I could help you",
        "You are welcome, is there anything else i can assist you with?"
      ],
      "context_set": ""
    },
    {
      "tag": "inappropriate",
      "patterns": [
        "I love you",
        "Will you marry me",
        "Do you love me",
        "fuck",
        "bitch",
        "shut up",
        "hell",
        "stupid",
        "idiot",
        "dumb ass",
        "asshole",
        "fucker"
      ],
      "responses": [
        "I cannot help you with this, please ask appropriate query",
        "please use an appropriate language",
        "Maintaining decency would be appreciated"
      ],
      "context_set": ""
    },
    {
      "tag": "ability",
      "patterns": [
        "what can you do?",
        "what are the things you can do?",
        "things you can do",
        "what can you do for me?",
        "how can you help me?",
        "why I should use you?"
      ],
      "responses": [
        "I can assist you with some basic information about weather, time, etc",
        "You can ask me questions regarding some basic information, and i will try to answer them",
        "I'm here to assist and chat with you, so feel free to ask me anything!",
        "My main focus is providing useful information and engaging in conversation with you."
      ],
      "context_set": ""
    },
    {
      "tag": "weather",
      "patterns": [
        "What's the weather like today?",
        "Tell me the current weather",
        "How's the weather outside?",
        "Is it going to rain?",
        "Weather forecast"
      ],
      "responses": [
        ""
      ],
      "context_set": ""
    },
    {
      "tag": "time",
      "patterns": [
        "What's the current time?",
        "Can you tell me the time?",
        "Time"
      ],
      "responses": [
        ""
      ],
      "context_set": ""
    },
    {
      "tag": "informal_question",
      "patterns": [
        "What's up?",
        "How's your day?",
        "What's new?",
        "Got any plans for the weekend?",
        "Tell me a joke!"
      ],
      "responses": [
        "Not much, just here to chat with you.",
        "My day is going well. How about yours?",
        "Nothing much is new. What about you?",
        "I'm an AI, so I don't have weekend plans, but I'm always here to chat!",
        "Sure, here's a joke: Why don't scientists trust atoms? Because they make up everything!"
      ],
      "context_set": ""
    },
    {
      "tag": "formal_question",
      "patterns": [
        "Could you please provide more information?",
        "May I ask a question?",
        "Could you elaborate on that?",
        "help"
      ],
      "responses": [
        "Certainly! I'd be happy to provide more information.",
        "Of course! Feel free to ask your question.",
        "Absolutely! I'll be happy to elaborate on that topic."
      ],
      "context_set": ""
    },
    {
      "tag": "motivation",
      "patterns": [
        "I feel demotivated.",
        "How can I stay motivated?",
        "I need some motivation.",
        "Feeling low, any motivational words?"
      ],
      "responses": [
        "Remember that every great journey starts with a small step. Keep moving forward!",
        "Challenges are what make life interesting. Embrace them and stay motivated!",
        "Believe in yourself, for you are capable of achieving incredible things!",
        "Your dreams are within reach. Stay focused and motivated to turn them into reality.",
        "Don't be discouraged by setbacks. They are stepping stones to success. Keep going!"
      ],
      "context_set": ""
    },
    {
      "tag": "default",
      "patterns": [],
      "responses": [
        "I'm sorry, I can't help with that.",
        "Please try asking a different question",
        "I'm sorry, I don't understand that."
      ],
      "context_set": ""
    },
    {
      "tag": "psoriasis",
      "patterns": [
        "I have been experiencing a skin rash on my arms, legs, and torso for the past few weeks. It is red, itchy, and covered in dry, scaly patches.",
        "My skin has been peeling, especially on my knees, elbows, and scalp. This peeling is often accompanied by a burning or stinging sensation.",
        "I have been experiencing joint pain in my fingers, wrists, and knees. The pain is often achy and throbbing, and it gets worse when I move my joints.",
        "There is a silver like dusting on my skin, especially on my lower back and scalp. This dusting is made up of small scales that flake off easily when I scratch them.",
        "My nails have small dents or pits in them, and they often feel inflammatory and tender to the touch. Even there are minor rashes on my arms.",
        "The skin on my palms and soles is thickened and has deep cracks. These cracks are painful and bleed easily.",
        "The skin around my mouth, nose, and eyes is red and inflamed. It is often itchy and uncomfortable. There is a noticeable inflammation in my nails.",
        "My skin is very sensitive and reacts easily to changes in temperature or humidity. I often have to be careful about what products I use on my skin.",
        "I have noticed a sudden peeling of skin at different parts of my body, mainly arms, legs and back. Also, I face severe joint pain and skin rashes.",
        "The skin on my genitals is red and inflamed. It is often itchy, burning, and uncomfortable. There are rashes on different parts of the body too."
      ],
      "responses": [
        "Based on your symptoms, there is a possibility that you have Psoriasis. Please visit a doctor for further information."
      ],
      "context_set": ""
    },
    {
      "tag": "typhoid",
      "patterns": [
        "I have constipation and belly pain, and it's been really uncomfortable. The belly pain has been getting worse and is starting to affect my daily life. Moreover, I get chills every night, followed by a mild fever.",
        "I've also had some diarrhea, which has been really unpleasant. It's been coming and going, and it's been accompanied by abdominal cramps and bloating.",
        "I have been experiencing chills and fever, along with severe abdominal pain. I've been feeling really miserable overall, and I just can't seem to shake these symptoms.",
        "I've been having a lot of trouble keeping hydrated because of the vomiting and diarrhea. There is a mild fever along with constipation and headache.",
        "I've lost a lot of weight in the past week because I haven't been able to eat much due to nausea and vomiting. This is followed by mild fever, headache and belly pain. I'm really concerned about my health.",
        "The fatigue has been really uncomfortable, and I've had a lot of difficulties doing my usual activities. I've also been feeling really depressed and irritable. There is mild pain in the abdominal part too.",
        "I've had a persistent headache for the past week, and it's been getting worse. It's been accompanied by belly aches, constipation and diarrhea.",
        "I've been experiencing high fever, especially at night. It's been really uncomfortable. There is a mild headache along with constipation and diarrhea.",
        "I've been having a lot of difficulty breathing, and I feel like I'm constantly nauseous. I also have mild belly pain. It's been terrifying at times.",
        "Diarrhea has been really watery and foul-smelling, and it's been accompanied by abdominal pain. I feel like vomiting most of the time."
      ],
      "responses": [
        "Based on your symptoms, there is a possibility that you have Typhoid. Please visit a doctor for further information."
      ],
      "context_set": ""
    },
    {
      "tag": "dengue",
      "patterns": [
        "I am facing severe joint pain and vomiting. I have developed a skin rash that covers my entire body and is accompanied by intense itching. ",
        "I have been experiencing chills and shivering, despite being in a warm environment. My back pains all the time and there are red spots on my arms.",
        "I have been experiencing severe joint pain that makes it difficult for me to move and perform my daily activities. Also, I have lost my appetite because of which I feel weak.",
        "I have been vomiting frequently and have lost my appetite as a result. My joints and back pain all the time.",
        "I have a high fever accompanied with severe headache and body pain. I experience chills every night. There is a distinct pain behind my eyes too.",
        "I have been feeling extremely tired and fatigued, and I have no energy to do anything. I have developed rashes on my neck, which itch upon touching. ",
        "I have been experiencing a severe headache that is accompanied by pain behind my eyes. I have lost my appetite and experience chills every night. ",
        "I have been feeling nauseous and have a constant urge to vomit. There is a strong pain behind my eyes and there are small red spots all over my arms.",
        "I have developed red spots on my body that are itchy and inflamed. I am also experiencing high fever along with chills and shivering. ",
        "I have been experiencing muscle pain that makes it difficult for me to move around. I have lost my appetite and feel vomiting. My legs and back pain a lot. "
      ],
      "responses": [
        "Based on your symptoms, there is a possibility that you have Dengue. Please visit a doctor for further information."
      ],
      "context_set": ""
    },
    {
      "tag": "fungal_infection",
      "patterns": [
        "I have raised lumps, a rash that looks red and inflamed, discoloured areas of skin that are different colours from the rest of my skin, and itching on my skin.",
        "All over my body, there has been a severe itching that has been followed by a red, bumpy rash. My skin also has a few darkened spots and a few tiny, nodular breakouts. It has been happening for several days and is becoming worse.",
        "I've had a rash on my skin that looks like dischromic patches, and I also have a lot of nodular eruptions and really bad itching. During the previous week, it has become worse.",
        "I've had a rash that won't go away and a bothersome itching on my skin. In addition, I've seen some color-different areas and bumps that resemble knots or lumps on my skin.",
        "I have a rash all over my body, and I can't stop scratching because my skin is itchy. My skin also has a few spots where the hue is altered and some lumps and knot-like pimples.",
        "Recently, my skin has been quite itchy, and I have a rash all over my body. My skin also has a few spots where the hue is altered and some lumps and knot-like pimples.",
        "My skin has been itching a lot and developing a rash. Additionally, I have a few areas of my skin that are a different hue than the rest of it. Additionally, I have a few firm pimples or breakouts on my skin.",
        "All over my body has been itching like crazy, and now there are red areas all over. Additionally, some of the patches have a different tone than my natural skin. And on my skin, there are these lumps or pimples that have developed.",
        "My skin has been acting up recently, becoming extremely itchy and rashes-prone. Additionally, there are certain spots that deviate from my natural skin tone in terms of hue. And now my skin has these lumps or bumps that weren't there before.",
        "On my arms and legs, I have a lot of red pimples and itchy skin. My skin also has a few odd-looking lesions. And occasionally there are bumps that are somewhat uncomfortable."
      ],
      "responses": [
        "Based on your symptoms, there is a possibility that you have Fungal infection. Please visit a doctor for further information."
      ],
      "context_set": ""
    },
    {
      "tag": "common_cold",
      "patterns": [
        "I can't stop sneezing and my nose is really runny. I'm also really cold and tired all the time, and I've been coughing a lot. My fever is really high too, like way above normal.",
        "My nose is extremely runny, and I can't seem to stop sneezing. In addition, I constantly feel cold, exhausted, and I've been coughing a lot. My fever is also really high far above normal.",
        "I've been sneezing nonstop and I can't seem to shake this chill. I'm feeling really weak and tired, and my cough won't go away. My fever is really high",
        "I've been sneezing incessantly and I just can't get this chill to go away. I feel so weak and exhausted, and my cough won't stop. My temperature is really high.",
        "I'm constantly sneezing and my body is shaking from being cold. I'm so tired I can barely move and my head is killing me. My fever is through the roof",
        "I'm constantly sneezing, and the cold is making my body tremble. I'm so exhausted that I can hardly move, and my head hurts. My fever is quite high.",
        "I've been quite exhausted and ill. I'm sneezing nonstop and am quite cold. My head is throbbing, and I lack energy. Additionally, I have a very high fever and feel like I am on fire.",
        "I've been feeling really tired and sick. I've been sneezing a lot and I can't seem to get warm. I'm so tired and my head is killing me. And my fever is really high, like I'm boiling.",
        "I've been quite exhausted and ill. My throat has been quite painful, and I've had a fairly nasty cough. I've got a lot of chills and a pretty high temperature. Just feeling extremely run down and weak",
        "I've been quite exhausted and ill. I have been sneezing a lot and am having trouble warming up. I'm so exhausted, and my head hurts. And I feel like I am boiling over with my high temperature."
      ],
      "responses": [
        "Based on your symptoms, there is a possibility that you have Common Cold. Please visit a doctor for further information."
      ],
      "context_set": ""
    },
    {
      "tag": "pneumonia",
      "patterns": [
        "I've been feeling really cold and tired lately, and I've been coughing a lot with chest pain. My heart is beating really fast too, and when I cough, the phlegm is kind of a rusty color.",
        "I've been coughing a lot recently with chest pain and feeling incredibly chilly and exhausted. Additionally, my heart is thumping rapidly, and the phlegm I cough up has a reddish hue.",
        "I've been feeling really drained and cold, and I can't stop coughing. It hurts in my chest when I do, and my heart feels like it's racing. The mucus I'm coughing up is a gross brownish color.",
        "I've been exhausted and chilly, and I can't stop coughing. When I do, it pains in my chest and makes my heart race. My coughing mucous has a disgusting brownish hue.",
        "I've been having chills and feeling exhausted, and I can't seem to shake this cough. My chest hurts when I cough, and my heart feels like it's going a million miles an hour. The phlegm I'm coughing up is a dirty rust color.",
        "I've been experiencing chills, feeling worn out, and I can't seem to get rid of this cough. When I cough, my chest aches and my heart feels as like it is beating a million miles per hour. I'm coughing up a nasty rust-colored phlegm.",
        "I've been feeling really weak and cold lately, and this cough won't go away. It hurts in my chest when I cough, and my heart is pounding. The mucus I'm bringing up is a rusty brown color.",
        "I've been having chills and feeling really worn out, and this cough won't go away. My chest hurts when I cough, and my heart is racing. The mucus I'm bringing up is a gross brownish color.",
        "I've been experiencing chills, feel really exhausted, and my cough just won't go away. When I cough, my chest aches and my heart is pounding. It's a disgusting brownish hue, the mucous I'm coming up.",
        "I have a really high fever, and I'm having trouble breathing. I'm sweating a lot and feeling really cold and tired. My heart is beating really fast, and I have some brownish sputum"
      ],
      "responses": [
        "Based on your symptoms, there is a possibility that you have Pneumonia. Please visit a doctor for further information."
      ],
      "context_set": ""
    },
    {
      "tag": "acne",
      "patterns": [
        "I've been having a really bad rash on my skin lately. It's full of pus-filled pimples and blackheads. My skin has also been scarring a lot.",
        "I've just developed a severe rash on my skin. It's clogged with pus-filled pimples and blackheads. My skin has also been quite sensitive.",
        "My skin has been breaking out in a terrible rash lately. Blackheads and pus-filled pimples abound on it. Additionally, my skin has been scarring a lot.",
        "I've recently been experiencing a severe skin rash. Blackheads and pimples packed with pus are everywhere. Additionally, my skin has been scarring a lot.",
        "I've been having a very unhealthy rash on my skin latterly. It's filled with pus-filled pimples and blackheads. My skin has additionally been scarring heaps.",
        "My skin has just acquired a nasty rash. It's full of pus-filled pimples and blackheads. My skin has been really sensitive as well.",
        "A nasty rash has just appeared on my skin. Blackheads and pimples packed with pus are everywhere. Additionally, my skin has been extremely sensitive.",
        "I recently experienced a severe skin rash. Blackheads and pimples filled with pus are clogging it. Additionally, my skin has been quite irritated.",
        "My skin has recently been severely rashy. Blackheads and pus-filled pimples have blocked it. My skin has been quite delicate as well.",
        "Lately I've been experiencing a skin rash with a lot of pus-filled pimples and blackheads. My skin has also been scarring a lot."
      ],
      "responses": [
        "Based on your symptoms, there is a possibility that you have Acne. Please visit a doctor for further information."
      ],
      "context_set": ""
    },
    {
      "tag": "hypertension",
      "patterns": [
        "I have been experiencing a headache, chest pain, dizziness, and difficulty maintaining my balance. I also feel like I am having trouble concentrating",
        "Along with a headache, chest pain, instability, and balance issues, I've also been feeling dizzy. I also think I'm having problems focusing.",
        "Along with a head pain, chest pain, instability, and balance issues, I've also been feeling unwell. I also think I'm having problems focusing.",
        "In addition to a head pain, chest pain, instability, and balance issues, I've already been feeling unwell. I also suppose I'm having issues focusing.",
        "I've been experiencing balance issues, a headache, chest pain, and dizziness. My ability to concentrate and focus has also been challenging.",
        "I have been having a headache, chest pain, dizziness, and trouble with my balance. It has also been hard for me to focus and concentrate.",
        "I've been encountering trouble walking, a headache, chest pain, and dizziness. My concentration skills and focus has also been challenging.",
        "I've been encountering poor balance, a headache, chest pain, and dizziness. My ability to pay attention and focus has also been problematic.",
        "My coordination has been off, and I've been experiencing a headache, chest pain, and dizziness. Additionally, I've had trouble concentrating and focusing.",
        "My symptoms include a headache, chest pain, dizziness, lack of balance, and trouble concentrating."
      ],
      "responses": [
        "Based on your symptoms, there is a possibility that you have Hypertension. Please visit a doctor for further information."
      ],
      "context_set": ""
    },
    {
      "tag": "jaundice",
      "patterns": [
        "I have been experiencing intense itching, vomiting, and fatigue. I have also lost weight and have a high fever. My skin has turned yellow and my urine is dark. I have also been experiencing abdominal pain.",
        "I've been feeling extremely scratchy, sick, and worn out. In addition, I've lost weight and have a temperature. My urine is dark, and my skin has turned yellow. Additionally, I've been having stomach pain.",
        "I've felt really scratchy, nauseated, and worn out. I also had a high fever and lost weight. Both my skin and my urine have become yellow. Additionally, my stomach has been hurting.",
        "Extreme itchiness, sickness, and exhaustion have all been plaguing me. In addition, I developed a fever and lost weight. My pee is black, and I've developed a yellow rash. Additionally, I've had stomach ache.",
        "I have been having severe itching and vomiting. I am also very tired and have lost weight. My fever is high and my skin has turned yellow. My urine is dark and I have been experiencing abdominal pain",
        "I've been experiencing intense itching and nausea. I have lost weight and am also really exhausted. My skin has become yellow, and I have a severe fever. I have dark urine, and I've been having stomach pain.",
        "I've been throwing up and experiencing intense itching. Along with losing weight, I'm also really exhausted. My skin has become yellow, and my fever is really high. I've been having stomach pain and my pee is black.",
        "Strong itchiness and nausea have been bothering me. I have also lost weight and am really exhausted. I have a high fever, and my skin is becoming yellow. In addition to feeling stomach ache, my pee is black.",
        "I've been experiencing terrible itching and nausea. I've lost weight and am also really exhausted. My skin has become yellow and I have a severe temperature. I have dark urine and stomach ache.",
        "I have been feeling itchy and have been vomiting. I am also very fatigued and have lost weight. My fever is high and my skin has become yellow. My urine is dark and I have abdominal pain"
      ],
      "responses": [
        "Based on your symptoms, there is a possibility that you have Jaundice. Please visit a doctor for further information."
      ],
      "context_set": ""
    },
    {
      "tag": "malaria",
      "patterns": [
        "I've been experiencing severe itching, chills, vomiting, and a high fever. I'm also sweating a lot and have a headache. I feel nauseous and my muscles are really sore",
        "I've had a high temperature, vomiting, chills, and intense itching. I also have a headache and am perspiring a lot. I'm queasy, and my muscles hurt a lot.",
        "I've had a high temperature, vomiting, chills, and intense itching. I also have a headache and am perspiring a lot. I'm queasy, and my muscles hurt a lot.",
        "Strong itchiness, chills, nausea, and a high temperature have been plaguing me. Besides having a headache, I'm also perspiring a lot. My muscles are quite sore, and I feel sick.",
        "Along with my intense scratching, chills, nausea, and high fever, I've also been feeling really unwell. Along with my headache and excessive sweating, My muscles hurt a lot, and I feel queasy.",
        "I've had a high fever, chills, and intense itching. In addition, I have a headache and am perspiring a lot. My muscles hurt a lot, and I feel sick.",
        "I've had intense itching all over my body, accompanied by chills and vomiting. My fever is really high and I've been sweating excessively. I also have a headache and feel nauseous. My muscles are really painful.",
        "I've been experiencing severe body itchiness, chills, and vomiting. I have a really high fever, and I've been perspiring a lot. I also feel queasy and have a headache. My muscles are in excruciating discomfort.",
        "Along with severe body itchiness, chills, and nausea, I've been experiencing. I've been severely perspiring and have a very high fever. I'm feeling queasy and also have a headache. Really hurting muscles are me.",
        "I've been experiencing severe body itchiness, chills, and vomiting. I have a really high fever, and I've been perspiring a lot. I also feel queasy and have a headache. My muscles are in excruciating discomfort."
      ],
      "responses": [
        "Based on your symptoms, there is a possibility that you have Malaria. Please visit a doctor for further information."
      ],
      "context_set": ""
    },
    {
      "tag": "allergy",
      "patterns": [
        "I have a runny nose and I am sneezing all the time. My eyes are itchy and often watery, and I am coughing all the time. My head hurts and all the time",
        "I have sore throat and I am sneezing all the time. Sometimes I have swelling on my face like my lips and near my eyes. I just cant stop sneezing once I start sneezing",
        "I have difficulty in breathing and shortness of breath. I cough uncontrollably and get itchy eyes and swelling on my face and other body parts",
        "I have a nasal congestion and blocked nose. Sometimes at night I have chest pain and tightness. I have also lost my sense of smell and taste",
        "I have asthma like symptoms like wheezing and difficulty breathing. I often get fever and have headaches. I feel tired all the time",
        "I feel tired all the time, I have lost my taste and have a really sore throat. I also get feverish and often have muscle aches. Sometimes my whole body just cramps up",
        "I have been experiencing a loss of appetite and have difficulty swallowing food. I have been suffering from sore throat and runny nose also.",
        "I feel fatigued all the time, and have a tingling sensation in my throat. I have also developed flaky skin. Sometimes I get puffy eyes and sometimes puffs up too.",
        "I have stomach cramps, nausea and diarrhea. My throat is swollen, and I have difficulty breathing. Sometimes at night night I get chest pain and nauseous.",
        "I have itchy and red skin. Sometimes these result in flaking. My face and lips puff up and causes a lot of inconvenience. I get watery eyes sometimes and headaches when the puffing gets severe"
      ],
      "responses": [
        "Based on your symptoms, there is a possibility that you have allergy. Please visit a doctor for further information."
      ],
      "context_set": ""
    },
    {
      "tag": "drug_reaction",
      "patterns": [
        "I have a metallic taste in my mouth, and also have a sense of change of taste and smell. Sometimes get very unbearable joint pain and muscle pain",
        "I have headaches and migraines, have been having difficulty sleeping. I have been having muscle twitching and tremors. Sometimes I get lightheaded",
        "I have fever and feel very dizzy and lightheaded. My heart is beating very fast and I feel very confused. I am not able to think very clearing and everything feels very foggy",
        "I have rashes on my skin and these flake off from time to time. This leaves me prone to infection. My fingers start twitching and sometimes I experience tremors.",
        "I feel very nauseous and have chest pain. Recently I have been experiencing chest pain. I feel very uneasy and often sweat profusely",
        "I have itching all over my body, and rashes in my chest and back. I get flaky skin from time to time and often this leaves marks on my body.",
        "I have hair loss and there is a significant change in the texture of my hair. I have  dry and itchy scalp and increased dandruff. My skin is also getting very dry",
        "I am experiencing a decrease in my sex drive and difficulty to function sexually. I feel very light headed and confused and often experience brain fog",
        "I am experiencing changes in my menstrual cycle and unexpected vaginal discharge. I often get mood swings and feel agitated from time to time",
        "I have experienced significant weight gain and become very obese. I have changes in my appetite and cravings for different foods"
      ],
      "responses": [
        "Based on your symptoms, there is a possibility that you have drug reaction. Please visit a doctor for further information."
      ],
      "context_set": ""
    },
    {
      "tag": "diabetes",
      "patterns": [
        "I have increased thirst and frequent urination. I often have a dry mouth and throat. Recently I have been having increased hunger and appetite",
        "I have blurred vision and it only seems to be getting worse. I feel fatigued and tired all the time. I also feel very dizzy and light headed at times",
        "I have a dry mouth and throat. I also have been experiencing an increased appetite and hunger. However I do feel very tired at times",
        "I have slow healing of wounds and cuts. I have this tingling sensation in my hand and numbness in both my hands and feet",
        "I have mood changes and have difficulty concentrating. My mind feels hazy and foggy at times and it gets difficult to do even regular chores",
        "I have a feeling of tremors and muscle twitching. I have decreased sense of smell or taste and I feel fatigued. Sometimes I have a feeling of rapid heartbeat or palpitation",
        "I have rashes and skin irritations especially in the folds of the skin. There is also very slow healing of any cuts and bruises I have on my skin",
        "I have a frequent need to urinate and often have these uncontrollable urges. I feel dizzy and often confused. I have also been loss of visuals",
        "I have difficulty breathing especially during physical activity. I have unusual sweating and flushing. I frequently get yeast infections",
        "I have persistent dry cough. My infections dont seem to be healing and I have palpitations. I also have this problem of sore throat that does seem to go away"
      ],
      "responses": [
        "Based on your symptoms, there is a possibility that you have diabetes. Please visit a doctor for further information."
      ],
      "context_set": ""
    }
  ]
}
